Revit 2026 API

# AnalysisDisplayColorSettingsAreIntermediateColorsValid Method

---
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool AreIntermediateColorsValid(
	IList<AnalysisDisplayColorEntry> map
)
```
```vb
Public Function AreIntermediateColorsValid (
	map As IList(Of AnalysisDisplayColorEntry)
) As Boolean
```
```cpp
public:
bool AreIntermediateColorsValid(
	IList<AnalysisDisplayColorEntry^>^ map
)
```
```fsharp
member AreIntermediateColorsValid :
        map : IList<AnalysisDisplayColorEntry> -> bool
```

#### Parameters

map IListAnalysisDisplayColorEntry

#### Return Value

Boolean

#### Reference

AnalysisDisplayColorSettings Class

Autodesk.Revit.DB.Analysis Namespace